---
kind: type
id: T:Autodesk.Revit.Exceptions.NotTransmittedModelException
source: html/6b7f7376-d5bf-e5bd-2c77-446f7c72a047.htm
---
# Autodesk.Revit.Exceptions.NotTransmittedModelException

The exception thrown when OpenOptions were provided to deal with
a transmitted model, but the model is not transmitted.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class NotTransmittedModelException : InvalidOperationException
```